import emoji

normal_char = ["q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "a", "s", "d", "f", "g", "h", "j", "k", "l", "z",
               "x", "c", "v", "b", "n", "m", "й", "ц", "у", "к", "е", "н", "г", "ш", "щ", "з", "х", "ъ", "ф", "ы",
               "в", "а", "п", "р", "о", "л", "д", "ж", "э", "я", "ч", "с", "м", "и", "т", "ь", "б", "ю", "/", "(", ")",
               " ", "\\", "'", '"', 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', "#",
               '_', '-', '&', '*', '%', "!", "?", "!", "^", "$", "ё", "қ", "ў", "'", "♡", "ғ", "ҳ"]

caps_normal_char = ['Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'Z',
                    'X', 'C', 'V', 'B', 'N', 'M', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', 'Ф', 'Ы',
                    'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', "Ё", "Қ",
                    "Ў", "Ҳ", "Ғ"]


def send_name(name='ник', color='белый', user_id=000000, return_dict=False):
    nick = {

        "черный": [':black_circle:🎻ʀᴇ|', '🌅'],
        "чёрный": [':black_circle:🎻ʀᴇ|', '🌅'],
        "black": [':black_circle:🎻ʀᴇ|', '🌅'],
        "желтый": [':yellow_circle:🎻ʀᴇ|', '🌅'],
        "yellow": [':yellow_circle:🎻ʀᴇ|', '🌅'],
        "жёлтый": [':yellow_circle:🎻ʀᴇ|', '🌅'],
        "белый": [':white_circle:🎻ʀᴇ|', '🌅'],
        "white": [':white_circle:🎻ʀᴇ|', '🌅'],
        "ktm": ['🏮༄𝑲𝑻𝑴|', '🐈'],
        "katsu": ['🏮༄𝑲𝑻𝑴|', '🐈'],
        "катсу": ['🏮༄𝑲𝑻𝑴|', '🐈'],
        "нюдсы": ['💃🏻ɴ |', '🦇'],
        "бабочки": ['🖤𝐛𝐮𝐭𝐭|', '🦋'],
        "баттерфлай": ['🖤𝐛𝐮𝐭𝐭|', '🦋'],
        "butterfly": ['🖤𝐛𝐮𝐭𝐭|', '🦋'],
        "charged": ['𝗖𝗧🦾|', '🧑‍🏭'],
        "чаржед": ['𝗖𝗧🦾|', '🧑‍🏭'],
        "чаргет": ['𝗖𝗧🦾|', '🧑‍🏭'],
        "сварщики": ['𝗖𝗧🦾|', '🧑‍🏭'],
        "сварщик": ['𝗖𝗧🦾|', '🧑‍🏭'],
        "самурай": ["Sᴛ| |⛩", "🍃"],
        "самураи": ["Sᴛ| |⛩", "🍃"],
        "samurai": ["Sᴛ| |⛩", "🍃"],
        "фифи": ["🌐𝔣𝔦𝔣𝔦𝔨||", "🤖"],
        "фифитеам": ["🌐𝔣𝔦𝔣𝔦𝔨||", "🤖"],
        "фифитим": ["🌐𝔣𝔦𝔣𝔦𝔨||", "🤖"],
        "fifi": ["🌐𝔣𝔦𝔣𝔦𝔨||", "🤖"],
        "fifiteam": ["🌐𝔣𝔦𝔣𝔦𝔨||", "🤖"],
        "mori": ["morī |", "| ☠"],
        "memento": ["morī |", "| ☠"],
        "мори": ["morī |", "| ☠"],
        "мементо": ["morī |", "| ☠"],
        "моменто": ["morī |", "| ☠"],
    }

    if return_dict:
        list_of_trig = [i for i, o in nick.items()]
        return "\n".join(list_of_trig)
    else:
        try:
            x = emoji.emojize(f"{nick[color][0]}")
            z = emoji.emojize(f"{nick[color][1]}")
            y = emoji.emojize(f"{emoji.emojize(name)}")
            if user_id == 819411604:
                return f"{x}{emoji.emojize(':joystick:')}{y}{emoji.emojize(':musical_note:')}{z}"
            elif user_id == 785644394:
                return f"{x}{'𝐭𝐢𝐦𝐚'}{z}"
            else:
                return f"{x}{y}{z}"
        except KeyError:
            return 'Такого триггера не существует'
